In [379]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [380]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [381]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

#1

In [382]:
df['extra'] = [10045.0, 10055.0, 10065.0, 10075.0, 10085.0]

In [383]:
df

            From_To  FlightNumber  RecentDelays              Airline    extra
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)  10045.0
1      MAdrid_miLAN           NaN            []    <Air France> (12)  10055.0
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )  10065.0
3    Budapest_PaRis           NaN          [13]       12. Air France  10075.0
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"  10085.0

In [384]:
df['FlightNumber'] = df.apply(lambda row: row['extra'] if np.isnan(row['FlightNumber']) else row['FlightNumber'], axis=1)

In [385]:
df.drop('extra', axis=1, inplace=True)

In [386]:
df = df.astype({'FlightNumber':int})

In [387]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

#2

In [388]:
data = df.copy()
data

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [389]:
df['From,To'] = df.apply(lambda row: row['From_To'].split('_'), axis=1)
df['From'] = df.apply(lambda row: row['From,To'][0], axis=1)
df['To'] = df.apply(lambda row: row['From,To'][1], axis=1)
df.drop('From,To', axis=1, inplace=True)
#df.drop('From_To', axis=1, inplace=True)

In [390]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

#3

In [391]:
df['From'] = df.apply(lambda row: row['From'].capitalize(), axis=1)
df['To'] = df.apply(lambda row: row['To'].capitalize(), axis=1)

In [392]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London

#4

In [393]:
'''
Not sure what "attach the temporary dataframe from the previous questions" means
'''
df.drop('From_To', axis=1, inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

#5

In [394]:
delays = df['RecentDelays'].to_frame()
delays

   RecentDelays
0      [23, 47]
1            []
2  [24, 43, 87]
3          [13]
4      [67, 32]

In [395]:
delays['len'] = delays.apply(lambda row: len(row['RecentDelays']), axis=1)

In [396]:
delays

   RecentDelays  len
0      [23, 47]    2
1            []    0
2  [24, 43, 87]    3
3          [13]    1
4      [67, 32]    2

In [397]:
delays.len.max()

3

In [398]:
cols = ['delay_'+str(x) for x in range(1, N+1)]

In [399]:
cols

['delay_1', 'delay_2', 'delay_3']

In [400]:
def fillDelays():
    for i in range(1, N+1):
        delays['delay_'+str(i)] = delays.apply(lambda row: row['RecentDelays'][i-1] if len(row['RecentDelays']) >= i else np.nan, axis=1)

In [401]:
fillDelays()

In [402]:
delays

   RecentDelays  len  delay_1  delay_2  delay_3
0      [23, 47]    2     23.0     47.0      NaN
1            []    0      NaN      NaN      NaN
2  [24, 43, 87]    3     24.0     43.0     87.0
3          [13]    1     13.0      NaN      NaN
4      [67, 32]    2     67.0     32.0      NaN

In [403]:
finaldf = pd.concat([df, delays], axis=1)

In [404]:
finaldf

,FlightNumber,RecentDelays,Airline,From,To,RecentDelays,len,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,"[23, 47]",2,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,[],0,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,"[24, 43, 87]",3,24.0,43.0,87.0
3,10075,[13],12. Air France,Budapest,Paris,[13],1,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,"[67, 32]",2,67.0,32.0,NaN

In [405]:
finaldf.drop(columns=['RecentDelays', 'len'], axis=1, inplace=True)

In [406]:
finaldf

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN